organizer/app/controllers/users_controller.rb

  def create
    @user = User.create(params.require(:user).permit(:email,
                                                     :password))
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"