app/controllers/services_controller.rb

  def create
    allowed_params = service_params
    @service = Service.new(allowed_params)
    @service.user_id = current_user.id

    respond_to do |format|
      if @service.save
---
INSERT INTO "services" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def set_service
    @service = Service.find(params[:id])
---
SELECT "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]